{
	"top": "TB",
	"sidebar": [
		{
			"id": "about-site",
			"text": "Intro"
		},
		{
			"id": "about-me",
			"text": "About"
		},
		{
			"id": "jobs",
			"text": "Work"
		},
		{
			"id": "projects",
			"text": "Projects"
		},
		{
			"id": "connect",
			"text": "Connect"
		}
	],
	"title": "Tyler Bauer",
	"section": [
		{
			"id": "about-site",
			"type": "title-text",
			"title": "What is this place?",
			"body": [
				"Hello there! My name is Tyler Bauer and I am a senior at the University of Washington studying Informatics. In case you do not know what Informatics is, here is a quick overview: Informatics is the midpoint between Computer Science, User Design and User Experience, and Business. I have the pleasure of learning about development skills including Java, Web Development and even Android. I also have the opportunity to develop my ability to design for a wide range of users and the specific needs that they have. I also have the skills to work in dispersed and non-dispersed teams to achieve project goals, as well as analyse and operate business processes along the way. My focus at the university has left me with a wide range of skills and abilities that I cannot wait to put to good use in industry.",
				"Below you will find a grid with some of the projects I have worked on, beginning with this very website that you are viewing. I designed and wrote up the code for the website myself (with the help from some libraries).",
				"Please enjoy your stay here with me, and feel free to reach out and connect with me below.",
				"Tyler Bauer"
			]
		},
		{
			"id": "about-me",
			"type": "title-two-col-img-lists",
			"title": "About Me",
			"body": {
				"imgSrc": "/static/img/profile/profile.jpg",
				"imgAlt": "headshot of Tyler Bauer",
				"dob": "May 16th, 1995",
				"school": "University of Washington",
				"degree": "Bachelor's of Science in Informatics",
				"skills": [
					"Leadership",
					"Time Management",
					"Dispersed Teams"
				],
				"languages": [
					"Java",
					"HTML",
					"CSS",
					"JavaScript",
					"SQL",
					"Git",
					"GitHub",
					"Python",
					"R"
				]
			}
		},
		{
			"id": "jobs",
			"type": "list-of-jobs",
			"title": "Work Experience",
			"body": [
				{
					"company": "Automatic Products",
					"title": "Web Developer",
					"start": "August 2016",
					"end": "Current",
					"description": "Automatic Products hired me on as a temporary web developer to revamp their current website. This includes a full rework of the organization, structure and functionality that the old site provides. Specifically, the new site is built upon PHP for both email forms and reusing HTML. The other big improvement is the ability for the website to be responsive to their mobile users."
				},
				{
					"company": "Staples",
					"title": "EasyTech Associate",
					"start": "April 2015",
					"end": "September 2016",
					"description": "As an Easy Tech Associate, I was tasked with coming into work to an army of sick and broken computers that I needed to crank though in my measly 5-hour shifts. Specifically, I had to talk to customers bringing in their computers for repair, figure out what it was they were actually meaning when they described their problem, recommend a solution, and provide rationale as to why my solution was correct while translating it into terms that most people can relate to. After they left their computer, I had to juggle my time between sitting behind my counter and fixing said computer, walking around the floor helping people find things, recommending certain laptops and printers for people's needs, finding crazy back-assward solutions to people's unique problems, and running up to the front to backup cashier. One thing I took away from working at Staples was the skills to communicate to people. I learned very quickly how to communicate with people of all calibers when talking about technology."
				},
				{
					"company": "Dick's Sporting Goods",
					"title": "Bike Tech",
					"start": "June 2014",
					"end": "April 2015",
					"description": "At Dick's Sporting Goods, I was tasked with being the go-to guy when anyone needed information or work done on: bikes, tennis rackets, exercise equipment and any team sport. I had to run two departments in opposite corners of the store by myself. I also had to cover the hunting and fishing department when needed, as well as run a backup cash register if they were swamped. If there is one thing that I can say that I learned from this job, it is that I know how to hold my own when the going gets tough, and I can always expect to come out on top."
				}
			]
		},
		{
			"id": "projects",
			"type": "list-of-projects",
			"title": "Projects",
			"body": [
				{
					"title": "Seattle Crime",
					"demo": "http://tbauer516.github.io/WorkExamples/INFO370-Website/",
					"description": "This project was completed in a team of 4. We used R and Python to manipulate the data which we pulled from Seattle's own data repository. Once the data was in a usable manner, we used Tableau for the cool visualization found on the page. The R statistical tests and logistical regression were not included in this site, as they were for our classroom environment only.",
					"completed": "December 4, 2016",
					"source": "https://github.com/tbauer516/INFO370-Website"
				},
				{
					"title": "Click Accuracy",
					"demo": "http://tbauer516.github.io/WorkExamples/ClickAccuracy/",
					"description": "This was a project I created for my Research Methods course, as it can gauge the accuracy of using a pointing device. It was intended to be used by several different people on the same computer, as the test is dependent on resolution and screen size. It uses an HTML canvas element that records clicks and stores the data in a Firebase Array that can be later retrieved for analysis.",
					"completed": "November 30, 2016",
					"source": "https://github.com/tbauer516/ClickAccuracy"
				},
				{
					"title": "Location Tagger",
					"demo": "http://imgur.com/a/QYk7M",
					"description": "Location Tagger lets a user place a location based message on the map, similar to the chalk messages written on the ground all around the UW. Another user can then find and view these messages in either a list view, or through augmented reality.",
					"completed": "May 26, 2016",
					"source": "https://github.com/tbauer516/LocationTagger"
				},
				{
					"title": "ToDo List",
					"demo": "http://tbauer516.github.io/WorkExamples/Todo%20List/#/",
					"description": "This was a simple social sharing todo list that I created as part of a team of four for my Web Development class. It features Firebase as well as Angular to receive instant updates when changes are made. It also features a full user authentication system when logging in or signing up.",
					"completed": "December 9, 2015",
					"source": "https://github.com/tbauer516/WorkExamples/tree/master/Todo%20List"
				},
				{
					"title": "Dawg Coffee",
					"demo": "http://tbauer516.github.io/WorkExamples/dawg-coffee/#/",
					"description": "This is a fake e-commerce site that sells coffee. It uses angular and utilizes the browsers localstorage for the shopping cart.",
					"completed": "November 19, 2015",
					"source": "https://github.com/tbauer516/WorkExamples/tree/master/dawg-coffee"
				},
				{
					"title": "Sound Cloud Challenge",
					"demo": "http://tbauer516.github.io/WorkExamples/soundcloud/",
					"description": "This was an website I made as part of a class assignment that features the Soundcloud API as the main feature. Specifically, it allows the user to search for tracks and add them to a playlist that appears on the right.",
					"completed": "November 3, 2015",
					"source": "https://github.com/tbauer516/WorkExamples/tree/master/soundcloud"
				},
				{
					"title": "Product Review",
					"demo": "http://tbauer516.github.io/WorkExamples/reviewer/",
					"description": "This site uses Parse (before it shut down), jQuery and Raty in order to create a single product page that users can type reviews on. Uses a full 5 star system from Raty as well as Parse as the back-end.",
					"completed": "October 27, 2015",
					"source": "https://github.com/tbauer516/WorkExamples/tree/master/reviewer"
				},
				{
					"title": "Police Shooting Map",
					"demo": "http://tbauer516.github.io/WorkExamples/shooting-map/",
					"description": "This is an interactive map of the US that uses data that was collected about police shootings and the resulting victims. This particular page uses Leaflet for the map interactivity and MapBox as the map layout.",
					"completed": "October 19, 2015",
					"source": "https://github.com/tbauer516/WorkExamples/tree/master/shooting-map"
				}
			]
		},
		{
			"id": "connect",
			"type": "closing",
			"title": "Connect With Me",
			"linkedin": {
				"url": "https://www.linkedin.com/in/tbauer516",
				"text": "LinkedIn Profile"
			},
			"email": {
				"text": "Email Me"
			},
			"closing": "Thank you for visiting my humble website. I hope you enjoyed your time here. Please feel free to connect with me by visiting my LinkedIn profile and inviting me to connect. If you would like to communicate with me immediately, feel free to send me an email. If you really liked me, feel free to do both."
		}
	]
}